In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    columns=["Name", "Age", "Height"],
)

In [3]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [4]:
df.loc[0] = ["Allen", 25, 175]

In [5]:
df

    Name  Age  Height
0  Allen   25     175

In [7]:
df.loc[1] = ["Bob", 30, 180]
df.loc[2] = ["Cathy", 28, 165]

In [8]:
df

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [9]:
df["Weight"] = [70, 80, 60]

In [10]:
df

    Name  Age  Height  Weight
0  Allen   25     175      70
1    Bob   30     180      80
2  Cathy   28     165      60

In [13]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [14]:
df

    Name  Age  Height  Weight
0  Allen   25     175      70
1    Bob   30     180      80
2  Cathy   28     165      60

In [15]:
df = df.drop("Weight", axis=1)
df

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [16]:
df.drop(2)

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180

In [17]:
df

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [18]:
df = df.drop(2)

In [19]:
df

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180

In [20]:
df["Height"][0]

np.int64(175)

In [21]:
df["Height"][0] = 178

/var/folders/_k/k5dry95j0q5d35_9pn5d86vm0000gn/T/ipykernel_51030/1784337542.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Height"][0] = 178
/var/folders/_k/k5dry95j0q5d35_9pn5d86vm0000gn/T/ipykernel_51030/1784337542.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Height"][0] = 178

In [22]:
df

    Name  Age  Height
0  Allen   25     178
1    Bob   30     180

In [23]:
df.loc[0, "Height"]

np.int64(178)

In [24]:
df.loc[0, "Height"] = 179

In [25]:
df

    Name  Age  Height
0  Allen   25     179
1    Bob   30     180

In [27]:
df.loc[0:1, "Age":"Height"]

   Age  Height
0   25     179
1   30     180

In [28]:
df

    Name  Age  Height
0  Allen   25     179
1    Bob   30     180

In [ ]:
"""
select
    Name
    , Age
    , Height
from df2
"""
data = [
    ["Allen", 25, 175],
    ["Bob", 30, 180],
    ["Cathy", 28, 165],
]
columns = ["Name", "Age", "Height"]
df2 = pd.DataFrame(data, columns=columns)

In [30]:
df2

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [ ]:
"""
select * from df
union all
select * from df2
"""
pd.concat(
    [df, df2],
    ignore_index=True,
)

    Name  Age  Height
0  Allen   25     179
1    Bob   30     180
2  Allen   25     175
3    Bob   30     180
4  Cathy   28     165

In [32]:
df["Age"]

0    25
1    30
Name: Age, dtype: int64